import React, { Component } from 'react';

import '../../assets/styles/usecontract.less';

export default class ReqContract extends Component {
  render() {
    return (
      <div className="contract">
        <h5>咨询服务协议</h5>
        <p className="conNum">编号：</p>
        <p>甲方</p>
        <p>身份证号码：</p>
        <p>联系地址：</p>
        <p className="mgt20">联系电话：</p>

        <p>
          乙方：<b> 北京榆钱投资管理有限公司 </b>
        </p>
        <p>法定代表人：陈鹏</p>
        <p>联系地址：北京市海淀区北四环西路68号5层520</p>
        <p>联系电话：</p>
        <p className="title">鉴 于</p>
        <p>
          乙方利用自有资源为甲方寻找资金富足方作为出借人，从而满足甲方的融资借款需求，根据《中华人民共和国民法通则》、《中华人民共和国合同法》及其他有关法律法规的规定，甲、乙双方协商一致，就乙方为甲方提供上述服务相关事宜订立本协议，以资共同信守。
        </p>
        <p className="title">第一条 协议成立</p>
        <p>
          甲方、乙方同意以网络页面点击确认或其他方式（包括但不限于签字、签章或盖章确认等方式）签订本协议，并不以此为由拒绝履行本协议项下义务。
        </p>
        <p>
          本协议由甲方以电子合同方式订立，即甲方在乙方平台通过点击类似确认字样按钮后，本协议即时成立并生效。
        </p>
        <p className="title">第二条 乙方服务内容</p>
        <p>2.1审核及推荐：</p>
        <p>
          乙方负责甲方的全程风险控制和管理，负责调查、审核甲方身份、财产、信用状况、申请借款等信息，审核通过的由乙方推荐给出借人。
        </p>
        <p>2.2代收款：</p>
        <p>
          甲方不可撤销地授权乙方代收出借人出借款项，甲方同意，出借款项支付至甲方指定账户即视为借款成功，账户信息如下：
        </p>
        <p>账户一:</p>
        <p>户名：北京榆钱投资管理有限公司；</p>
        <p>开户行：中国民生银行北京建国门外支行；</p>
        <p>账号：695964974；</p>
        <p>账户二:</p>
        <p>户名：北京榆钱投资管理有限公司；</p>
        <p>开户行：中国建设银行北京保福寺支行；</p>
        <p>账号：11050163990000000296；</p>
        <p>
          甲方同意，自借款起息之日起及首次还款日时向乙方、商品/服务销售方支付服务费，商品/服务销售方服务费由乙方代为收取，甲方应支付服务费合计为___，商品/服务销售方服务费收取金额由乙方与商品/服务销售方的合作协议另行约定，甲方同意乙方可从代甲方收取的借款本金中直接扣除服务费后将剩余款项支付至甲方。
        </p>
        <p>甲方同意仍应当按照《借款协议》约定的借款本金和利息向出借人还本付息。</p>
        <p>2.3代还款</p>
        <p>
          甲方委托乙方代收出借人的还款款项。甲方以《借款协议》约定的方式每月向出借人还款，并按《借款协议》每月应归还的本金及利息打款至乙方指定的代收还款账户。
        </p>
        <p className="title">第三条 甲方的权利和义务</p>
        <p>
          3.1甲方知晓并同意，乙方受限于国家政策，不对在校学生提供服务。甲方承诺本人并非在校学生。
        </p>
        <p>
          3.2甲方应保证提供给乙方的资料均真实、准确、有效（包括但不限于姓名、身份证号、是否为在校学生、手机号码、银行卡号等信息）；若因甲方提供信息有误，造成的一切不利后果均由甲方自行承担，与乙方无关，若由此对乙方造成损失的甲方负责赔偿一切损失。
        </p>
        <p>
          3.3甲方保证所借款项用于合法用途，若甲方使用所借款项从事违法犯罪活动的，乙方可要求甲方立即提前还款，若司法机关介入的，乙方将全力协助司法机关调查取证，甲方信息由此泄露的，乙方不承担任何责任。
        </p>
        <p className="title">第四条 乙方的权利和义务</p>
        <p>4.1乙方应按照本协议约定向甲方提供服务。</p>
        <p>
          4.2乙方须对涉及本协议项下服务内容的行为进行监督、检查，有权要求甲方提供相关资料和文件，有权要求甲方对有关问题作出说明，有权对甲方进行贷后管理，要求甲方改正借款后出现的违约、违法行为。
        </p>
        <p className="title">第五条 陈述和保证</p>
        <p>5.1甲方承诺为善意、有权缔约的完全民事行为能力人，并认可本协议对甲方具有法律约束力。</p>
        <p>
          5.2乙方是合法登记设立的、符合中国法律规定的企业法人；乙方具备为签署本协议所需的内部授权程序，签署本协议的是乙方的有效授权代表，并且本协议对乙方具有法律约束力。
        </p>
        <p>
          5.3乙方无法也没有义务保证甲方在发出借款要约意向后，能够实际成功获得借款，由此可能导致的损失由甲方自行承担，乙方不承担任何责任。
        </p>
        <p>
          5.4甲乙双方一致同意并保证，如果出借人要求乙方为甲方的该借款承担连带保证担保的情况下，乙方应当为甲方出具连带保证担保的担保函；并且甲方同意在乙方对于该借款的本金及利息、逾期利息、损害赔偿金、违约金及实现债权而发生的费用承担连带保证担保责任后，有权立即在代为清偿的范围内取代出借人的地位行使对甲方的一切追偿权利，包括接管一切为甲方债务设立的担保物。同时甲方应按如下方式向乙方支付逾期管理费:
        </p>
        <p>三个月（含）之内的应还未还本金，逾期管理费=应还本金×逾期天数×____。</p>
        <p>超过三个月的应还未还本金，逾期管理费=应还本金×逾期天数×____。</p>
        <p className="title">第六条 违约责任</p>
        <p>
          因任何一方的违约行为给另一方造成损失的，应由违约方承担赔偿责任，包括但不限于律师费、调查取证费等实现债权的费用。
        </p>
        <p className="title">第七条 协议的变更和解除</p>
        <p>
          7.1除非本协议另有约定，本协议生效后，任何一方不得单方面变更或解除本协议。对本协议的修改或变更必须经甲方、乙方协商一致，并达成书面协议。
        </p>
        <p>
          7.2如遇国家法律、法规或政策变化，致使本协议的全部或部分条款不再符合国家法律、法规或政策的要求，乙方可根据相关变动修改有关条款。
        </p>
        <p>
          7.3甲方、乙方由于不可抗力不能履行协议的，应及时通知对方并采取有效措施防止损失扩大。遭受不可抗力的一方应在事件发生后5个工作日内向对方提供该不可抗力事件的详细情况和有关政府部门出具的有关该不可抗力事件的发生及影响的证明文件。甲方、乙方应及时协商解决措施。甲方对《借款协议》及本协议的违反不属于不可抗力。
        </p>
        <p className="title">第八条 保密条款</p>
        <p>
          8.1本协议任何一方不得向其他人（各自的经办雇员及其雇用的中介机构所涉及人员除外）透露本协议的内容，但依法应披露信息的情形除外.
        </p>
        <p>8.2双方在业务合作中形成的知识产权归乙方所有。</p>
        <p className="title">第九条 争议解决</p>
        <p>
          9.1因本协议发生争议，由双方协商解决，协商不成，甲、乙双方均同意提请珠海仲裁委员会，按照珠海仲裁委员会互联网金融仲裁规则仲裁；如该规则尚未实施,则适用《珠海仲裁委员会仲裁规则》,以简易程序,书面审理，答辩期为被申请人收到仲裁通知之日起5日内，双方同意由仲裁委员会主任在案件受理后指定一名仲裁员组成仲裁庭，仲裁庭有权按照适当的方式快捷地进行仲裁程序，且具体程序和期限不受仲裁规则其他条款限制。仲裁裁决是终局的，对双方当事人均有约束力。9.2
          对于因合同争议引起的任何纠纷甲方声明珠海仲裁委员会可以以手机短信或电子邮件等现代通讯方式或邮寄方式向借款人送达法律文书（包括但不限于仲裁通知文书）。甲方同意将电子邮件作为送达地址，或按以下通讯联系地址作为接收仲裁案件法律文书的送达地址，法律文书一经发送或邮寄即视为有效送达。
        </p>
        <p>甲方电子邮箱：</p>
        <p>甲方地址：</p>
        <p>甲方联系手机号：</p>
        <p className="title">第十条 服务期限</p>
        <p>
          本协议项下服务期限自本协议生效之日起，至甲方在《借款协议》项下的所有义务全部履行完毕。
        </p>
        <p className="title">第十一条 其他事项</p>
        <p>
          11.1本协议经甲方、乙方通过网络页面点击确认方式或其他方式（包括但不限于签字、签章或盖章确认等方式）签订，本协议一经签订即生效。
        </p>
        <p>11.2双方一致同意本协议以乙方留存版本为准。</p>
        <p>
          11.3双方均确认，本协议的签订、生效和履行以不违反法律为前提。如果本协议中的任何一条或多条违反适用的法律，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。
        </p>
        <p>11.4本协议未尽事宜，由双方协商处理，或者按国家有关法律、法规的规定执行。</p>
        <p>
          11.5本协议的各项补充、修订或变更，包括本协议的附件、附录及补充协议，为本协议的完整组成部分。
        </p>
        <p>11.6本协议中所使用的定义，除非另有规定，乙方享有解释权。</p>
        <p>11.7本协议中相关名词定义以《借款协议》为准。</p>
        <p>11.8本协议签订地：北京市海淀区。</p>
        <p className="mgt20">（以下无正文）</p>
        <div className="con-div">
          <p>甲方（签字按印）：</p>
          {/*<p className="mgt20">日期：年 月 日</p>*/}
          {/*<img className="img1" src={require("../../assets/images/chen.png")}/>*/}
        </div>
        <div className="con-div">
          <p>乙方（盖章）：</p>
          <p>法定代表人（签字或盖章）：</p>
          <p className="mgt20">签订日期：年 月 日</p>
        </div>
      </div>
    );
  }
}
